1m3_27mm_wall_H2_test_29/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingBuoyantFoam; //reactingFoam;

startFrom       startTime;

startTime       0;

endTime         80;

deltaT          1e-4; //0.01; // Adjust based on CFL for 6.5 m/s

writeControl    adjustableRunTime;  //timeStep;

writeInterval   10;

purgeWrite      10;//0;

writeFormat     binary; //ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2.0; //1;

functions
{
    probes_H2_vertical
    {
        type            probes;
        libs            (sampling);
        writeControl    runTime;//writeTime;
        writeInterval   0.1;
        probeLocations
        (
            (0.45 0 0.04) // x=0.45 m (5 cm from right wall)
            (0.45 0 0.105)  
            (0.45 0 0.17)
            (0.45 0 0.235)
            (0.45 0 0.3)
            (0.45 0 0.365)
            (0.45 0 0.43)
            (0.45 0 0.495)
            (0.45 0 0.56)
            (0.45 0 0.625)
            (0.45 0 0.69)
            (0.45 0 0.755)
            (0.45 0 0.82)
            (0.45 0 0.885)
            (0.45 0 0.95)
        );
        fields          (H2);
    }

    probes_H2_horizontal
    {
        type            probes;
        libs            (sampling);
        //excuting and sampling frequency
        executeControl  runTime;
        executeInterval 0.1;    //execute every 0.1 s
        writeControl    runTime;
        writeInterval   0.1;    //write every 0.1 s
        probeLocations
        (
            (    0 0.0 0.95)
            ( 50e-3 0.0 0.95)
            (100e-3 0.0 0.95)
            (150e-3 0.0 0.95)
            (200e-3 0.0 0.95)
            (250e-3 0.0 0.95)
            (300e-3 0.0 0.95)
            (350e-3 0.0 0.95)
            (400e-3 0.0 0.95)
            (450e-3 0.0 0.95)
        );
        fields          (H2);
    }

    myResiduals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");

        executeControl  timeStep;
        executeInterval 100;      // Sample less frequently

        writeControl    timeStep;
        writeInterval   100;      // Write every 100 timesteps
                                  
        // List the fields to monitor (add more as needed)
        fields          (p U k epsilon h H2);

        // Optional: Set to 'yes' to also output residual fields to time directories
        // writeResidualFields yes;

        // Optional: Control when to execute (defaults to timeStep if unspecified)
        // executeControl  timeStep;
        // executeInterval 1;
    }
/*
    massFlowVentLower
    {
        type            surfaceFieldValue;//patchFlowRate;
        libs            (fieldFunctionObjects);
        //excuting and sampling frequency
        executeControl  runTime;
        executeInterval 0.1;    //execute every 0.1 s
        writeControl    runTime;
        writeInterval   0.1;    //write every 0.1 s
        log                 true;
        writeFields         no;
        regionType      patch;
        name            vent_lower;
        operation       sum;
        fields          (phi);
    }
    massFlowVentUpper
    {
        type            surfaceFieldValue;//patchFlowRate;
        libs            (fieldFunctionObjects);
        //excuting and sampling frequency
        executeControl  runTime;
        executeInterval 0.1;    //execute every 0.1 s
        writeControl    runTime;
        writeInterval   0.1;    //write every 0.1 s
        log                 true;
        writeFields         no;
        regionType      patch;
        name            vent_upper;
        operation       sum;
        fields          (phi);
    }
*/    
}
// ************************************************************************* //
